{
  "ashanti": {
    "id": "ashanti",
    "name": "Ashanti",
    "englishName": "Ashanti Region",
    "description": "The historical heartland of the Ashanti Kingdom in central Ghana.",
    "culturalSignificance": "The Ashanti Region is the traditional home of Kente weaving, where the craft reached its highest development under royal patronage. The Ashanti Kingdom was known for its sophisticated political organization, gold wealth, and artistic achievements.",
    "traditionalPatterns": ["checker_pattern", "zigzag_pattern", "diamonds_pattern"],
    "traditionalColors": ["gold", "black", "green"],
    "historicalContext": "The Ashanti Kingdom emerged in the 17th century and became one of the most powerful states in West Africa. Kente weaving flourished under royal patronage, with certain patterns reserved exclusively for royalty.",
    "notableLocations": ["Kumasi", "Bonwire", "Adanwomase"]
  },
  "ewe": {
    "id": "ewe",
    "name": "Ewe",
    "englishName": "Volta Region",
    "description": "The eastern region of Ghana, home to the Ewe people and their distinctive weaving tradition.",
    "culturalSignificance": "The Ewe people developed their own distinctive style of Kente weaving, characterized by more pictorial designs and narrative elements. Ewe Kente often incorporates symbols that tell specific stories or convey proverbs.",
    "traditionalPatterns": ["stripes_horizontal_pattern", "stripes_vertical_pattern"],
    "traditionalColors": ["blue", "red", "white"],
    "historicalContext": "Ewe weaving traditions developed independently from Ashanti Kente but share some technical similarities. Ewe weavers were less constrained by royal regulations and could experiment more freely with designs.",
    "notableLocations": ["Kpetoe", "Ho", "Agbozume"]
  },
  "fante": {
    "id": "fante",
    "name": "Fante",
    "englishName": "Central Region",
    "description": "The coastal region of Ghana, home to the Fante people who were early intermediaries between Europeans and inland kingdoms.",
    "culturalSignificance": "The Fante people adapted and incorporated elements from various cultural traditions due to their position as coastal traders. Their textile traditions reflect this cultural synthesis, with influences from both indigenous and European sources.",
    "traditionalPatterns": ["stripes_horizontal_pattern", "square_pattern"],
    "traditionalColors": ["blue", "white", "red"],
    "historicalContext": "The Fante states formed a confederation in the 18th century to resist Ashanti expansion and European encroachment. Their position as coastal intermediaries gave them access to imported textiles and dyes that influenced their weaving traditions.",
    "notableLocations": ["Cape Coast", "Elmina", "Mankessim"]
  },
  "northern": {
    "id": "northern",
    "name": "Northern",
    "englishName": "Northern Region",
    "description": "The northern savanna region of Ghana, home to diverse ethnic groups with distinct textile traditions.",
    "culturalSignificance": "Northern Ghanaian textile traditions emphasize strip weaving, batik, and tie-dye techniques. These textiles often feature geometric patterns that reflect the region's Islamic influences and traditional symbolism.",
    "traditionalPatterns": ["stripes_vertical_pattern", "checker_pattern"],
    "traditionalColors": ["indigo", "white", "earth tones"],
    "historicalContext": "The northern regions were influenced by trans-Saharan trade routes and Islamic culture. Textile production was an important economic activity, with specialized weaving villages developing distinctive styles.",
    "notableLocations": ["Tamale", "Bolgatanga", "Wa"]
  },
  "ga_adangme": {
    "id": "ga_adangme",
    "name": "Ga-Adangme",
    "englishName": "Greater Accra Region",
    "description": "The southeastern coastal region of Ghana, home to the Ga and Adangme peoples.",
    "culturalSignificance": "The Ga-Adangme peoples developed textile traditions that reflect their coastal location and historical connections to neighboring groups. Their ceremonial cloths often incorporate symbols related to fishing, trading, and urban life.",
    "traditionalPatterns": ["checker_pattern", "stripes_horizontal_pattern"],
    "traditionalColors": ["red", "yellow", "blue"],
    "historicalContext": "The Ga-Adangme peoples established coastal settlements that later developed into important trading centers, including Accra. Their textile traditions were influenced by both indigenous practices and imported techniques from European and other African sources.",
    "notableLocations": ["Accra", "Tema", "Ada"]
  }
}
